---
kind: type
id: T:Autodesk.Revit.DB.IFC.ExporterIFCUtils
source: html/e0e78d67-739c-0cd6-9e3d-359e42758c93.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFCUtils

A class that contains utilities needed to implement Revit's version of the IFC export client application.

## Syntax (C#)
```csharp
public static class ExporterIFCUtils
```

## Remarks
This class contains special API utilities needed to enable the implementation of the client application
 for IFC export. Some of these utilities will be needed temporarily while the code for IFC export is
 migrated into the export client. These temporary interfaces are likely to change in upcoming Revit
 releases.